Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM1216PL10032.svd
               <register>
                  <name>OUT</name>
                  <description>Data Output Value</description>
                  <addressOffset>0x10</addressOffset>
                  <fields>
                     <field>
                        <name>OUT0</name>
                        <description>PORT Data Output Value 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT1</name>
                        <description>PORT Data Output Value 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT2</name>
                        <description>PORT Data Output Value 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT3</name>
                        <description>PORT Data Output Value 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT4</name>
                        <description>PORT Data Output Value 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT5</name>
                        <description>PORT Data Output Value 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT6</name>
                        <description>PORT Data Output Value 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT7</name>
                        <description>PORT Data Output Value 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT8</name>
                        <description>PORT Data Output Value 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT9</name>
                        <description>PORT Data Output Value 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT10</name>
                        <description>PORT Data Output Value 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT11</name>
                        <description>PORT Data Output Value 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT12</name>
                        <description>PORT Data Output Value 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT13</name>
                        <description>PORT Data Output Value 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT14</name>
                        <description>PORT Data Output Value 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT15</name>
                        <description>PORT Data Output Value 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT16</name>
                        <description>PORT Data Output Value 16</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT17</name>
                        <description>PORT Data Output Value 17</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT18</name>
                        <description>PORT Data Output Value 18</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT19</name>
                        <description>PORT Data Output Value 19</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT20</name>
                        <description>PORT Data Output Value 20</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT21</name>
                        <description>PORT Data Output Value 21</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT22</name>
                        <description>PORT Data Output Value 22</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT23</name>
                        <description>PORT Data Output Value 23</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT24</name>
                        <description>PORT Data Output Value 24</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT25</name>
                        <description>PORT Data Output Value 25</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT26</name>
                        <description>PORT Data Output Value 26</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT27</name>
                        <description>PORT Data Output Value 27</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT28</name>
                        <description>PORT Data Output Value 28</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT29</name>
                        <description>PORT Data Output Value 29</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT30</name>
                        <description>PORT Data Output Value 30</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT31</name>
                        <description>PORT Data Output Value 31</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTCLR</name>
                  <description>Data Output Value Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <fields>
                     <field>
                        <name>OUT0CLR</name>
                        <description>PORT Data Output Value 0 Clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT1CLR</name>
                        <description>PORT Data Output Value 1 Clear</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT2CLR</name>
                        <description>PORT Data Output Value 2 Clear</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT3CLR</name>
                        <description>PORT Data Output Value 3 Clear</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT4CLR</name>
                        <description>PORT Data Output Value 4 Clear</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT5CLR</name>
                        <description>PORT Data Output Value 5 Clear</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT6CLR</name>
                        <description>PORT Data Output Value 6 Clear</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT7CLR</name>
                        <description>PORT Data Output Value 7 Clear</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT8CLR</name>
                        <description>PORT Data Output Value 8 Clear</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT9CLR</name>
                        <description>PORT Data Output Value 9 Clear</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT10CLR</name>
                        <description>PORT Data Output Value 10 Clear</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT11CLR</name>
                        <description>PORT Data Output Value 11 Clear</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT12CLR</name>
                        <description>PORT Data Output Value 12 Clear</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT13CLR</name>
                        <description>PORT Data Output Value 13 Clear</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT14CLR</name>
                        <description>PORT Data Output Value 14 Clear</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT15CLR</name>
                        <description>PORT Data Output Value 15 Clear</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT16CLR</name>
                        <description>PORT Data Output Value 16 Clear</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT17CLR</name>
                        <description>PORT Data Output Value 17 Clear</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT18CLR</name>
                        <description>PORT Data Output Value 18 Clear</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT19CLR</name>
                        <description>PORT Data Output Value 19 Clear</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT20CLR</name>
                        <description>PORT Data Output Value 20 Clear</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT21CLR</name>
                        <description>PORT Data Output Value 21 Clear</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT22CLR</name>
                        <description>PORT Data Output Value 22 Clear</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT23CLR</name>
                        <description>PORT Data Output Value 23 Clear</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT24CLR</name>
                        <description>PORT Data Output Value 24 Clear</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT25CLR</name>
                        <description>PORT Data Output Value 25 Clear</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT26CLR</name>
                        <description>PORT Data Output Value 26 Clear</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT27CLR</name>
                        <description>PORT Data Output Value 27 Clear</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT28CLR</name>
                        <description>PORT Data Output Value 28 Clear</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT29CLR</name>
                        <description>PORT Data Output Value 29 Clear</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT30CLR</name>
                        <description>PORT Data Output Value 30 Clear</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT31CLR</name>
                        <description>PORT Data Output Value 31 Clear</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
